# Pandas Data Input and Output - Reading CSV and other Data

In [39]:
import pandas as pd

In [40]:
%cd "/Users/tanojudawattage/1_tanoj/0.00_Cloud_Computing_and_Streaming_Tech/Python_for_Finance_Files/03- General Pandas"

/Users/tanojudawattage/1_tanoj/0.00_Cloud_Computing_and_Streaming_Tech/Python_for_Finance_Files/03- General Pandas

In [41]:
df = pd.read_csv("example")

**Install libraries** <br/>
pip or conda install lxml<br>
pip or conda install html5lib<br>
pip or conda install BeautifulSoup4<br>

In [42]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [43]:
df.to_csv("My_output", index=False)

In [44]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

# Excel worksheets

In [45]:
# working with excel file workbooks
pd.read_excel("Excel_Sample.xlsx", sheet_name="Sheet1")

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [46]:
# write dataframe to excel
df.to_excel("Excel_Sample2.xlsx", sheet_name="NewSheet")

# Reading form HTML

In [47]:
data = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

Pandas will convert the table markings in the HTML tags into a dataframe

In [48]:
data[0].head()

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund Sort ascending
0,The Santa Anna National Bank,Santa Anna,Texas,5520,Coleman County State Bank,"June 27, 2025",10549
1,Pulaski Savings Bank,Chicago,Illinois,28611,Millennium Bank,"January 17, 2025",10548
2,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,First Bank & Trust Co.,"October 18, 2024",10547
3,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
4,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545

# SQL Engine

In [49]:
from sqlalchemy import create_engine

In [50]:
engine = create_engine('sqlite:///:memory:')

In [51]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [52]:
# write df to sql table engine
df.to_sql('my_table', engine)

4

In [53]:
sqldf = pd.read_sql('my_table', con=engine)

In [54]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15